[
    {
    "pmid": 39230868,
    "title": "The Potential of Mitochondrial Therapeutics in the Treatment of Oxidative Stress and Inflammation in Aging.",
    "abstract": "Mitochondria are central to cellular energy production, and their dysfunction is a major contributor to oxidative stress and chronic inflammation, pivotal factors in aging, and related diseases. With aging, mitochondrial efficiency declines, leading to an increase in ROS and persistent inflammatory responses. Therapeutic interventions targeting mitochondrial health show promise in mitigating these detrimental effects. Antioxidants such as MitoQ and MitoVitE, and supplements like coenzyme Q10 and NAD + precursors, have demonstrated potential in reducing oxidative stress. Additionally, gene therapy aimed at enhancing mitochondrial function, alongside lifestyle modifications such as regular exercise and caloric restriction can ameliorate age-related mitochondrial decline. Exercise not only boosts mitochondrial biogenesis but also improves mitophagy. Enhancing mitophagy is a key strategy to prevent the accumulation of dysfunctional mitochondria, which is crucial for cellular homeostasis and longevity. Pharmacological agents like sulforaphane, SS-31, and resveratrol indirectly promote mitochondrial biogenesis and improve cellular resistance to oxidative damage. The exploration of mitochondrial therapeutics, including emerging techniques like mitochondrial transplantation, offers significant avenues for extending health span and combating age-related diseases. However, translating these findings into clinical practice requires overcoming challenges in precisely targeting dysfunctional mitochondria and optimizing delivery mechanisms for therapeutic agents. Continued research is essential to refine these approaches and fully understand the interplay between mitochondrial dynamics and aging.",
    "pubdate": "2024-09-04",
    "journal": "bioRxiv",
    "affiliation": "GloNeuro, Sector 107, Vishwakarma Road, Noida, Uttar Pradesh, 201301, India. jitendrakumarsinha@gmail.com.",
    "GrantId": null,
    "founders": null,
    "url": "https://pubmed.ncbi.nlm.nih.gov/39230868"
  },
  {
    "pmid": 39179117,
    "title": "Targeting organ-specific mitochondrial dysfunction to improve biological aging.",
    "abstract": "In an aging society, unveiling new anti-aging strategies to prevent and combat aging-related diseases is of utmost importance. Mitochondria are the primary ATP production sites and key regulators of programmed cell death. Consequently, these highly dynamic organelles play a central role in maintaining tissue function, and mitochondrial dysfunction is a pivotal factor in the progressive age-related decline in cellular homeostasis and organ function. The current review examines recent advances in understanding the interplay between mitochondrial dysfunction and organ-specific aging. Thereby, we dissect molecular mechanisms underlying mitochondrial impairment associated with the deterioration of organ function, exploring the role of mitochondrial DNA, reactive oxygen species homeostasis, metabolic activity, damage-associated molecular patterns, biogenesis, turnover, and dynamics. We also highlight emerging therapeutic strategies in preclinical and clinical tests that are supposed to rejuvenate mitochondrial function, such as antioxidants, mitochondrial biogenesis stimulators, and modulators of mitochondrial turnover and dynamics. Furthermore, we discuss potential benefits and challenges associated with the use of these interventions, emphasizing the need for organ-specific approaches given the unique mitochondrial characteristics of different tissues. In conclusion, this review highlights the therapeutic potential of addressing mitochondrial dysfunction to mitigate organ-specific aging, focusing on the skin, liver, lung, brain, skeletal muscle, and lung, as well as on the reproductive, immune, and cardiovascular systems. Based on a comprehensive understanding of the multifaceted roles of mitochondria, innovative therapeutic strategies may be developed and optimized to combat biological aging and promote healthy aging across diverse organ systems.",
    "pubdate": "2024-08-22",
    "journal": "Aging",
    "affiliation": "Division of Molecular Biology and Biochemistry, Medical University of Graz, BioTechMed-Graz, Austria. Electronic address: corina.madreiter@medunigraz.at.",
    "GrantId": null,
    "founders": null,
    "url": "https://pubmed.ncbi.nlm.nih.gov/39179117"
  },
  {
    "pmid": 37030614,
    "title": "Mitochondrion: A bridge linking aging and degenerative diseases.",
    "abstract": "Aging is a natural process, characterized by progressive loss of physiological integrity, impaired function, and increased vulnerability to death. For centuries, people have been trying hard to understand the process of aging and find effective ways to delay it. However, limited breakthroughs have been made in anti-aging area. Since the hallmarks of aging were summarized in 2013, increasing studies focus on the role of mitochondrial dysfunction in aging and aging-related degenerative diseases, such as neurodegenerative diseases, osteoarthritis, metabolic diseases, and cardiovascular diseases. Accumulating evidence indicates that restoring mitochondrial function and biogenesis exerts beneficial effects in extending lifespan and promoting healthy aging. In this paper, we provide an overview of mitochondrial changes during aging and summarize the advanced studies in mitochondrial therapies for the treatment of degenerative diseases. Current challenges and future perspectives are proposed to provide novel and promising directions for future research.",
    "pubdate": "2023-04-06",
    "journal": "Life sciences",
    "affiliation": "Center for Plastic & Reconstructive Surgery, Department of Hand & Reconstructive Surgery, Zhejiang Provincial People's Hospital, Affiliated People's Hospital, Hangzhou Medical College, Hangzhou, Zhejiang, China.",
    "GrantId": null,
    "founders": null,
    "url": "https://pubmed.ncbi.nlm.nih.gov/37030614"
  },
  {
    "pmid": 34715739,
    "title": "The Many Roles Mitochondria Play in Mammalian Aging.",
    "abstract": "Significance: Aging is a natural process that affects most living organisms, resulting in increased mortality. As the world population ages, the prevalence of age-associated diseases, and their associated health care costs, has increased sharply. A better understanding of the molecular mechanisms that lead to cellular dysfunction may provide important targets for interventions to prevent or treat these diseases. Recent Advances: Although the mitochondrial theory of aging had been proposed more than 40 years ago, recent new data have given stronger support for a central role for mitochondrial dysfunction in several pathways that are deregulated during normal aging and age-associated disease. Critical Issues: Several of the experimental evidence linking mitochondrial alterations to age-associated loss of function are correlative and mechanistic insights are still elusive. Here, we review how mitochondrial dysfunction may be involved in many of the known hallmarks of aging, and how these pathways interact in an intricate net of molecular relationships. Future Directions: As it has become clear that mitochondrial dysfunction plays causative roles in normal aging and age-associated diseases, it is necessary to better define the molecular interactions and the temporal and causal relationship between these changes and the relevant phenotypes seen during the aging process. Antioxid. Redox Signal. 36, 824-843.",
    "pubdate": "2022-01-04",
    "journal": "Antioxidants & redox signaling",
    "affiliation": "Lab. Genética Mitocondrial, Departamento de Bioquímica, Instituto de Química, Universidade de São Paulo, São Paulo, Brazil.",
    "GrantId": null,
    "founders": null,
    "url": "https://pubmed.ncbi.nlm.nih.gov/34715739"
  },
  {
    "pmid": 40170077,
    "title": "Regulation of cellular senescence in tumor progression and therapeutic targeting: mechanisms and pathways.",
    "abstract": "Cellular senescence, a stable state of cell cycle arrest induced by various stressors or genomic damage, is recognized as a hallmark of cancer. It exerts a context-dependent dual role in cancer initiation and progression, functioning as a tumor suppressor and promoter. The complexity of senescence in cancer arises from its mechanistic diversity, potential reversibility, and heterogeneity. A key mediator of these effects is the senescence-associated secretory phenotype (SASP), a repertoire of bioactive molecules that influence tumor microenvironment (TME) remodeling, modulate cancer cell behavior, and contribute to therapeutic resistance. Given its intricate role in cancer biology, senescence presents both challenges and opportunities for therapeutic intervention. Strategies targeting senescence pathways, including senescence-inducing therapies and senolytic approaches, offer promising avenues for cancer treatment. This review provides a comprehensive analysis of the regulatory mechanisms governing cellular senescence in tumors. We also discuss emerging strategies to modulate senescence, highlighting novel therapeutic opportunities. A deeper understanding of these processes is essential for developing precision therapies and improving clinical outcomes.",
    "pubdate": "2025-04-02",
    "journal": "Nature",
    "affiliation": "Department of Neurosurgery, Xiangya Hospital, Central South University, 87 Xiangya Road, Changsha, Hunan, China.",
    "GrantId": "NO.2022YK04",
    "founders": "Science Foundation of the AMHT Group",
    "url": "https://pubmed.ncbi.nlm.nih.gov/40170077"
  },
  {
    "pmid": 40120861,
    "title": "Molecular signatures of cellular senescence in cancer: a critical review of prognostic implications and therapeutic opportunities.",
    "abstract": "Cellular senescence is a state of permanent loss of proliferative capacity. Therefore, cells that reach a senescent state prevent tumor initiation, acting as an anti-tumor mechanism. However, despite not being proliferative, senescent cells have high secretory activity, constituting the Senescence-Associated Secretory Phenotype (SASP). SASP includes thousands of soluble molecules and extracellular vesicles, through which senescent cells can affect other cells and the extracellular matrix. In advanced tumors, the enrichment of senescent cells can have anti- or pro-tumor effects depending on features like SASP composition, tumor microenvironment (TME) composition, the anatomic site, histopathologic characteristics of malignancy, and tumor molecular background. We reviewed the studies assessing the impact of the senescence status, measured by mRNA or lncRNA molecular signatures, in the prognosis and other clinically relevant information in cancer, including anti-tumor immunity and response to therapy. We discussed the pros and cons of different strategies to define those molecular signatures and the main limitations of the studies. Finally, we also raised clinical challenges regarding the crossroad between cellular senescence and cancer prognosis, including some therapeutic opportunities in the field.",
    "pubdate": "2025-03-20",
    "journal": "Mechanisms of ageing and development",
    "affiliation": "Center of Biotechnology, Universidade Federal do Rio Grande do Sul, Porto Alegre, Rio Grande do Sul 91501-970, Brazil; Experimental Research Center, Hospital de Clínicas de Porto Alegre, Porto Alegre, Rio Grande do Sul 90035-903, Brazil. Electronic address: dcssousa8@gmail.com.",
    "GrantId": null,
    "founders": null,
    "url": "https://pubmed.ncbi.nlm.nih.gov/40120861"
  },
  {
    "pmid": 40072368,
    "title": "Beyond pills and prescriptions: Exploring aging-related diseases with non-pharmacological strategies and molecular innovations.",
    "abstract": "This paper provides a thorough examination of aging-related diseases, exploring into the intricate molecular mechanisms that underline their development and progression. It explores cutting-edge therapeutic interventions aimed at addressing these conditions, with a particular focus on non-pharmacological approaches such as personalized lifestyle modifications, cognitive enhancement strategies, and robust social engagement initiatives. Additionally, it highlights emerging modalities including gene therapy and precision medicine as promising avenues for mitigating the challenges associated with age-related ailments. Despite significant strides in research, persistent barriers such as limited healthcare access and regulatory complexities continue to impede the widespread implementation of these innovative approaches. Overcoming these obstacles requires collaborative efforts to promote health equity and ensure equitable access to transformative treatments. By advancing our understanding and embracing innovative paradigms, we can catalyze a profound transformation toward healthier aging trajectories. Through sustained interdisciplinary collaborations, rigorous research endeavors, and proactive advocacy initiatives, we can aspire to cultivate a future where aging is synonymous with vitality, dignity, and enhanced well-being for individuals worldwide.",
    "pubdate": "2025-02-20",
    "journal": "Aging and disease",
    "affiliation": "Department of Cell and Molecular Biology, International Center for Neuroscience Research, Institute for Intelligent Research, Tbilisi, Georgia.",
    "GrantId": null,
    "founders": null,
    "url": "https://pubmed.ncbi.nlm.nih.gov/40072368"
  }
]